JuhoL/ASch/Hal_STM32F429ZI/tests/UTest_Hal_Clocks.cpp
//-----------------------------------------------------------------------------------------------------------------------------
// Copyright (c) 2019 Juho Lepistö
// 
// Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated
// documentation files (the "Software"), to deal in the Software without restriction, including without 
// limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of
// the Software, and to permit persons to whom the Software is furnished to do so, subject to the following
// conditions:
//
// The above copyright notice and this permission notice shall be included in all copies or substantial
// portions of the Software.
// 
// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED
// TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL
// THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF
// CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS
// IN THE SOFTWARE.
//-----------------------------------------------------------------------------------------------------------------------------

//! @file    UTest_Hal_Clocks.cpp
//! @author  Juho Lepistö juho.lepisto(a)gmail.com
//! @date    25 Jul 2019
//! 
//! @brief   These are unit tests for Hal_Clocks.cpp
//! 
//! These are unit tests for Hal_Clocks.cpp utilising Catch2 and FakeIt.

//-----------------------------------------------------------------------------------------------------------------------------
// 1. Include Files
//-----------------------------------------------------------------------------------------------------------------------------

#include <Catch_Utils.hpp>

#include <Hal_Clocks.hpp>
#include <Utils_Bit.hpp>
#include <stm32f429xx_mock.h>
#include <Utils_Assert_Mock.hpp>

#include <Hal_Internal_Mock.hpp>
#include <ASch_Configuration.hpp>

//-----------------------------------------------------------------------------------------------------------------------------
// 2. Test Structs and Variables
//-----------------------------------------------------------------------------------------------------------------------------

namespace
{

}

#define PRINT_PLL()     uint32_t pllp = (RCC->PLLCFGR & RCC_PLLCFGR_PLLP_Msk) >> RCC_PLLCFGR_PLLP_Pos; \
                        uint32_t plln = (RCC->PLLCFGR & RCC_PLLCFGR_PLLN_Msk) >> RCC_PLLCFGR_PLLN_Pos; \
                        uint32_t pllm = (RCC->PLLCFGR & RCC_PLLCFGR_PLLM_Msk) >> RCC_PLLCFGR_PLLM_Pos; \
                        uint32_t pllq = (RCC->PLLCFGR & RCC_PLLCFGR_PLLQ_Msk) >> RCC_PLLCFGR_PLLQ_Pos; \
                        INFO ("PLLCFGR: " << std::hex << RCC->PLLCFGR); \
                        INFO ("PLLP: " << pllp); \
                        INFO ("PLLN: " << plln); \
                        INFO ("PLLM: " << pllm); \
                        INFO ("PLLQ: " << pllq);

//-----------------------------------------------------------------------------------------------------------------------------
// 3. Test Cases
//-----------------------------------------------------------------------------------------------------------------------------

SCENARIO ("Clocks are enabled", "[hal_system]")
{
    Hal_Mock::InitRccRegisters();
    HalMock::InitInternal();
    ASchMock::Assert::Init();

    GIVEN ("HSI is disabled and clocks are functioning correctly")
    {
        // HSI is on by default, so disable it first.
        Utils::SetBit(RCC->CR, RCC_CR_HSIRDY_Pos, false);

        // This tells the HAL that the oscillator has started correctly.
        SET_RETURN(HalMock::mockHalInternal, WaitForBitToSet, false);

        WHEN ("the HSI clock is enabled")
        {
            Hal::Error error = Hal::Clocks::Enable(Hal::OscillatorType::highSpeed_internal);

            THEN ("no errors shall occur")
            {
                REQUIRE (error == Hal::Error::noErrors);
                
                AND_THEN ("HSION bit in RCC CR register shall be set and HSIRDY bit shall be waited")
                {
                    REQUIRE (Utils::GetBit(RCC->CR, RCC_CR_HSION_Pos) == true);
                    REQUIRE_PARAM_CALLS (1, HalMock::mockHalInternal, WaitForBitToSet, RCC->CR, RCC_CR_HSIRDY_Pos);
                }
            }
        }
    }

    GIVEN ("HSE is disabled and clocks are functioning correctly")
    {
        // This tells the HAL that the oscillator has started correctly.
        SET_RETURN(HalMock::mockHalInternal, WaitForBitToSet, false);

        WHEN ("the HSE clock is enabled")
        {
            Hal::Error error = Hal::Clocks::Enable(Hal::OscillatorType::highSpeed_external);

            THEN ("no errors shall occur")
            {
                REQUIRE (error == Hal::Error::noErrors);
                
                AND_THEN ("HSEON bit in RCC CR register shall be set and HSERDY bit shall be waited")
                {
                    REQUIRE (Utils::GetBit(RCC->CR, RCC_CR_HSEON_Pos) == true);
                    REQUIRE_PARAM_CALLS (1, HalMock::mockHalInternal, WaitForBitToSet, RCC->CR, RCC_CR_HSERDY_Pos);
                }
            }
        }
    }

    GIVEN ("LSI is disabled and clocks are functioning correctly")
    {
        // This tells the HAL that the oscillator has started correctly.
        SET_RETURN(HalMock::mockHalInternal, WaitForBitToSet, false);

        WHEN ("the LSI clock is enabled")
        {
            Hal::Error error = Hal::Clocks::Enable(Hal::OscillatorType::lowSpeed_internal);

            THEN ("no errors shall occur")
            {
                REQUIRE (error == Hal::Error::noErrors);

                AND_THEN ("LSION bit in RCC CSR register shall be set and LSIRDY bit shall be waited")
                {
                    REQUIRE (Utils::GetBit(RCC->CSR, RCC_CSR_LSION_Pos) == true);
                    REQUIRE_PARAM_CALLS (1, HalMock::mockHalInternal, WaitForBitToSet, RCC->CSR, RCC_CSR_LSIRDY_Pos);
                }
            }
        }
    }

