JuhoL/ASch/Hal_STM32F429ZI/tests/UTest_Hal_Clocks.cpp
    GIVEN ("LSE is disabled and clocks are functioning correctly")
    {
        // This tells the HAL that the oscillator has started correctly.
        SET_RETURN(HalMock::mockHalInternal, WaitForBitToSet, false);

        WHEN ("the LSE clock is enabled")
        {
            Hal::Error error = Hal::Clocks::Enable(Hal::OscillatorType::lowSpeed_external);

            THEN ("no errors shall occur")
            {
                REQUIRE (error == Hal::Error::noErrors);

                THEN ("LSEON bit in RCC BDCR register shall be set and LSERDY bit shall be waited")
                {
                    REQUIRE (Utils::GetBit(RCC->BDCR, RCC_BDCR_LSEON_Pos) == true);
                    REQUIRE_PARAM_CALLS (1, HalMock::mockHalInternal, WaitForBitToSet, RCC->BDCR, RCC_BDCR_LSERDY_Pos);
                }
            }
        }
    }

    GIVEN ("PLL is disabled and clocks are functioning correctly")
    {
        // This tells the HAL that the oscillator has started correctly.
        SET_RETURN(HalMock::mockHalInternal, WaitForBitToSet, false);

        WHEN ("the PLL clock is enabled")
        {
            Hal::Error error = Hal::Clocks::Enable(Hal::OscillatorType::pll);

            THEN ("no errors shall occur")
            {
                REQUIRE (error == Hal::Error::noErrors);

                THEN ("LSEON bit in RCC BDCR register shall be set and LSERDY bit shall be waited")
                {
                    REQUIRE (Utils::GetBit(RCC->CR, RCC_CR_PLLON_Pos) == true);
                    REQUIRE_PARAM_CALLS (1, HalMock::mockHalInternal, WaitForBitToSet, RCC->CR, RCC_CR_PLLRDY_Pos);
                }
            }
        }
    }

    GIVEN ("the oscillators are already running")
    {
        Utils::SetBit(RCC->CR, RCC_CR_HSERDY_Pos, true);
        Utils::SetBit(RCC->CSR, RCC_CSR_LSIRDY_Pos, true);
        Utils::SetBit(RCC->BDCR, RCC_BDCR_LSERDY_Pos, true);

        // This tells the HAL that the oscillator has started correctly.
        SET_RETURN(HalMock::mockHalInternal, WaitForBitToSet, false);

        WHEN ("the the clocks are enabled")
        {
            Hal::Error error = Hal::Clocks::Enable(Hal::OscillatorType::highSpeed_internal);
            Hal::Error error2 = Hal::Clocks::Enable(Hal::OscillatorType::highSpeed_external);
            Hal::Error error3 = Hal::Clocks::Enable(Hal::OscillatorType::lowSpeed_internal);
            Hal::Error error4 = Hal::Clocks::Enable(Hal::OscillatorType::lowSpeed_external);

            THEN ("no errors shall occur")
            {
                REQUIRE (error == Hal::Error::noErrors);
                REQUIRE (error2 == Hal::Error::noErrors);
                REQUIRE (error3 == Hal::Error::noErrors);
                REQUIRE (error4 == Hal::Error::noErrors);

                AND_THEN ("no configurations shall occur")
                {
                    REQUIRE_CALLS (0, HalMock::mockHalInternal, WaitForBitToSet);
                }
            }
        }
    }

    GIVEN ("HSE is disabled and clock fails to start")
    {
        // This tells the HAL that the oscillator has started correctly.
        SET_RETURN(HalMock::mockHalInternal, WaitForBitToSet, true);

        WHEN ("the HSE clock is enabled")
        {
            Hal::Error error = Hal::Clocks::Enable(Hal::OscillatorType::highSpeed_external);

            THEN ("timeout error shall occur")
            {
                REQUIRE (error == Hal::Error::timeout);
            }
        }
    }

    GIVEN ("the system is in init state")
    {
        WHEN ("secondary PLL is enabled directly")
        {
            Hal::Error error = Hal::Clocks::Enable(Hal::OscillatorType::pllSecondary);

            THEN ("parameter error shall occur")
            {
                REQUIRE (error == Hal::Error::invalidParameter);

                AND_THEN ("an assert failure shall trigger")
                {
                    REQUIRE (ASchMock::Assert::GetFails() == 1UL);
                }
            }
        }
    }
}

SCENARIO ("Clocks are disabled", "[hal_system]")
{
    Hal_Mock::InitRccRegisters();
    HalMock::InitInternal();
    ASchMock::Assert::Init();

    GIVEN ("HSI is enabled and is not used as a system clock")
    {
        Utils::SetBit(RCC->CR, RCC_CR_HSION_Pos, true);
        Utils::SetBit(RCC->CR, RCC_CR_HSIRDY_Pos, true);
        // HSE as system clock.
        Utils::SetBits(RCC->CFGR, RCC_CFGR_SWS_Msk, RCC_CFGR_SWS_0);

        // This tells the HAL that the oscillator has stopped correctly.
        SET_RETURN(HalMock::mockHalInternal, WaitForBitToClear, false);

        WHEN ("the HSI clock is disabled")
        {
            Hal::Error error = Hal::Clocks::Disable(Hal::OscillatorType::highSpeed_internal);

            THEN ("no errors shall occur")
            {
                REQUIRE (error == Hal::Error::noErrors);

                AND_THEN ("HSION bit in RCC CR register shall be cleared and HSERDY bit clearing shall be waited")
                {
                    REQUIRE (Utils::GetBit(RCC->CR, RCC_CR_HSION_Pos) == false);
                    REQUIRE_PARAM_CALLS (1, HalMock::mockHalInternal, WaitForBitToClear, RCC->CR, RCC_CR_HSIRDY_Pos);
                }
            }
        }
    }

    GIVEN ("HSE is enabled and clocks are functioning correctly")
    {
        Utils::SetBit(RCC->CR, RCC_CR_HSEON_Pos, true);
        Utils::SetBit(RCC->CR, RCC_CR_HSERDY_Pos, true);

        // This tells the HAL that the oscillator has stopped correctly.
        SET_RETURN(HalMock::mockHalInternal, WaitForBitToClear, false);

        WHEN ("the HSE clock is disabled")
        {
            Hal::Error error = Hal::Clocks::Disable(Hal::OscillatorType::highSpeed_external);

            THEN ("no errors shall occur")
            {
                REQUIRE (error == Hal::Error::noErrors);

                AND_THEN ("HSEON bit in RCC CR register shall be cleared and HSERDY bit clearing shall be waited")
                {
                    REQUIRE (Utils::GetBit(RCC->CR, RCC_CR_HSEON_Pos) == false);
                    REQUIRE_PARAM_CALLS (1, HalMock::mockHalInternal, WaitForBitToClear, RCC->CR, RCC_CR_HSERDY_Pos);
                }
            }
        }
    }

    GIVEN ("LSI is enabled and clocks are functioning correctly")
    {
        Utils::SetBit(RCC->CSR, RCC_CSR_LSION_Pos, true);
        Utils::SetBit(RCC->CSR, RCC_CSR_LSIRDY_Pos, true);

        // This tells the HAL that the oscillator has stopped correctly.
        SET_RETURN(HalMock::mockHalInternal, WaitForBitToClear, false);

        WHEN ("the LSI clock is disabled")
        {
            Hal::Error error = Hal::Clocks::Disable(Hal::OscillatorType::lowSpeed_internal);

            THEN ("no errors shall occur")
            {
                REQUIRE (error == Hal::Error::noErrors);

