JuhoL/ASch/Hal_STM32F429ZI/tests/UTest_Hal_Clocks.cpp
                AND_THEN ("LSION bit in RCC CSR register shall be cleared and LSIRDY bit clearing shall be waited")
                {
                    REQUIRE (Utils::GetBit(RCC->CSR, RCC_CSR_LSION_Pos) == false);
                    REQUIRE_PARAM_CALLS (1, HalMock::mockHalInternal, WaitForBitToClear, RCC->CSR, RCC_CSR_LSIRDY_Pos);
                }
            }
        }
    }

    GIVEN ("LSE is enabled and clocks are functioning correctly")
    {
        Utils::SetBit(RCC->BDCR, RCC_BDCR_LSEON_Pos, true);
        Utils::SetBit(RCC->BDCR, RCC_BDCR_LSERDY_Pos, true);

        // This tells the HAL that the oscillator has stopped correctly.
        SET_RETURN(HalMock::mockHalInternal, WaitForBitToClear, false);

        WHEN ("the LSE clock is disabled")
        {
            Hal::Error error = Hal::Clocks::Disable(Hal::OscillatorType::lowSpeed_external);

            THEN ("no errors shall occur")
            {
                REQUIRE (error == Hal::Error::noErrors);

                AND_THEN ("LSEON bit in RCC BDCR register shall be cleared and LSERDY bit clearing shall be waited")
                {
                    REQUIRE (Utils::GetBit(RCC->BDCR, RCC_BDCR_LSEON_Pos) == false);
                    REQUIRE_PARAM_CALLS (1, HalMock::mockHalInternal, WaitForBitToClear, RCC->BDCR, RCC_BDCR_LSERDY_Pos);
                }
            }
        }
    }

    GIVEN ("PLL is enabled and clocks are functioning correctly")
    {
        Utils::SetBit(RCC->CR, RCC_CR_PLLON_Pos, true);
        Utils::SetBit(RCC->CR, RCC_CR_PLLRDY_Pos, true);

        // This tells the HAL that the oscillator has stopped correctly.
        SET_RETURN(HalMock::mockHalInternal, WaitForBitToClear, false);

        WHEN ("the PLL clock is disabled")
        {
            Hal::Error error = Hal::Clocks::Disable(Hal::OscillatorType::pll);

            THEN ("no errors shall occur")
            {
                REQUIRE (error == Hal::Error::noErrors);

                AND_THEN ("PLLON bit in RCC CR register shall be cleared and PLLRDY bit clearing shall be waited")
                {
                    REQUIRE (Utils::GetBit(RCC->CR, RCC_CR_PLLON_Pos) == false);
                    REQUIRE_PARAM_CALLS (1, HalMock::mockHalInternal, WaitForBitToClear, RCC->CR, RCC_CR_PLLRDY_Pos);
                }
            }
        }
    }

    GIVEN ("the oscillators are already disabled")
    {
        // Disable HSI
        Utils::SetBit(RCC->CR, RCC_CR_HSIRDY_Pos, false);
        // Disable HSI as system clock
        Utils::SetBits(RCC->CFGR, RCC_CFGR_SWS_Msk, RCC_CFGR_SWS_Msk);

        // This tells the HAL that the oscillator has started correctly.
        SET_RETURN(HalMock::mockHalInternal, WaitForBitToClear, false);

        WHEN ("the the clocks are enabled")
        {
            Hal::Error error = Hal::Clocks::Disable(Hal::OscillatorType::highSpeed_internal);
            Hal::Error error2 = Hal::Clocks::Disable(Hal::OscillatorType::highSpeed_external);
            Hal::Error error3 = Hal::Clocks::Disable(Hal::OscillatorType::lowSpeed_internal);
            Hal::Error error4 = Hal::Clocks::Disable(Hal::OscillatorType::lowSpeed_external);

            THEN ("no errors shall occur")
            {
                REQUIRE (error == Hal::Error::noErrors);
                REQUIRE (error2 == Hal::Error::noErrors);
                REQUIRE (error3 == Hal::Error::noErrors);
                REQUIRE (error4 == Hal::Error::noErrors);

                AND_THEN ("no configurations shall occur")
                {
                    REQUIRE_CALLS (0, HalMock::mockHalInternal, WaitForBitToClear);
                }
            }
        }
    }

    GIVEN ("HSE is enabled and clock fails to stop")
    {
        Utils::SetBit(RCC->CR, RCC_CR_HSEON_Pos, true);
        Utils::SetBit(RCC->CR, RCC_CR_HSERDY_Pos, true);

        // This tells the HAL that the oscillator failed to stop.
        SET_RETURN(HalMock::mockHalInternal, WaitForBitToClear, true);

        WHEN ("the HSE clock is disabled")
        {
            Hal::Error error = Hal::Clocks::Disable(Hal::OscillatorType::highSpeed_external);

            THEN ("timeout error shall occur")
            {
                REQUIRE (error == Hal::Error::timeout);
            }
        }
    }

    GIVEN ("HSE is enabled and used as system clock")
    {
        // HSE is enabled
        Utils::SetBit(RCC->CR, RCC_CR_HSEON_Pos, true);
        Utils::SetBit(RCC->CR, RCC_CR_HSERDY_Pos, true);
        // Set HSE as system clock
        Utils::SetBits(RCC->CFGR, RCC_CFGR_SWS_Msk, RCC_CFGR_SWS_0);

        WHEN ("the HSE clock is disabled")
        {
            Hal::Error error = Hal::Clocks::Disable(Hal::OscillatorType::highSpeed_external);

            THEN ("reserved resource error shall occur")
            {
                REQUIRE (error == Hal::Error::reservedResource);

                AND_THEN ("an assert failure shall trigger")
                {
                    REQUIRE (ASchMock::Assert::GetFails() == 1UL);
                }
            }
        }
    }

    GIVEN ("PLL is enabled")
    {
        // PLL is enabled
        Utils::SetBit(RCC->CR, RCC_CR_PLLON_Pos, true);
        Utils::SetBit(RCC->CR, RCC_CR_PLLRDY_Pos, true);

        WHEN ("the secondary PLL clock is disabled")
        {
            Hal::Error error = Hal::Clocks::Disable(Hal::OscillatorType::pllSecondary);

            THEN ("invalid parameter error shall occur")
            {
                REQUIRE (error == Hal::Error::invalidParameter);

                AND_THEN ("an assert failure shall trigger")
                {
                    REQUIRE (ASchMock::Assert::GetFails() == 1UL);
                }
            }
        }
    }
}

SCENARIO ("PLL is configured", "[hal_system]")
{
    Hal_Mock::InitRccRegisters();
    HalMock::InitInternal();
    ASchMock::Assert::Init();

    GIVEN ("system is at init state")
    {
        // Set PLL source to HSE for checking that it gets cleared in case of HSI PLL source.
        Utils::SetBit(RCC->PLLCFGR, RCC_PLLCFGR_PLLSRC_Pos, true);

        WHEN ("PLL is enabled with source from HSI and target of 168MHz and the frequency is read back")
        {
            Hal::Error error = Hal::Clocks::ConfigurePll(Hal::OscillatorType::highSpeed_internal, Hal::MHz(168UL));
            Utils::SetBit(RCC->CR, RCC_CR_PLLRDY_Pos, true); // Set PLLRDY bit in order to be able to read the frequency.
            uint32_t frequency = Hal::Clocks::GetFrequency(Hal::OscillatorType::pll);
            uint32_t secondaryFrequency = Hal::Clocks::GetFrequency(Hal::OscillatorType::pllSecondary);

            THEN ("no errors shall occur")
            {
                REQUIRE (error == Hal::Error::noErrors);

                AND_THEN ("PLLP, PLLN, PLLM, and PLLQ shall have correct values")
                {
                    // 100MHz from 24MHz shall result in PLLP = 2, PLLN = 100, PLLM = 11.
                    PRINT_PLL();
                    INFO ("Frequency: " << frequency);
                    INFO ("Frequency: " << secondaryFrequency);

                    REQUIRE (Utils::CompareBits(RCC->PLLCFGR, RCC_PLLCFGR_PLLP_Msk, 0UL));
                    REQUIRE (Utils::CompareBits(RCC->PLLCFGR, RCC_PLLCFGR_PLLN_Msk, (63UL << RCC_PLLCFGR_PLLN_Pos)));
                    REQUIRE (Utils::CompareBits(RCC->PLLCFGR, RCC_PLLCFGR_PLLM_Msk, (3UL << RCC_PLLCFGR_PLLM_Pos)));
                    REQUIRE (Utils::CompareBits(RCC->PLLCFGR, RCC_PLLCFGR_PLLQ_Msk, (7UL << RCC_PLLCFGR_PLLQ_Pos)));
                    
                    AND_THEN ("the PLL frequency shall be set to 168MHz and secondary frequency to 48MHz")
                    {
                        REQUIRE (frequency == Hal::MHz(168UL));
                        REQUIRE (secondaryFrequency == Hal::MHz(48UL));

                        AND_THEN ("the PLL source is set to HSE")
                        {
                            REQUIRE (Utils::GetBit(RCC->PLLCFGR, RCC_PLLCFGR_PLLSRC_Pos) == false);
                        }
                    }
                }
            }
        }
    }

    GIVEN ("HSE is enabled and set as 24MHz")
    {
        // Enable HSE
        Utils::SetBit(RCC->CR, RCC_CR_HSERDY_Pos, true);
        // Set frequency
        Hal::Clocks::SetFrequency(Hal::OscillatorType::highSpeed_external, Hal::MHz(24UL));
        // Set PLL source to HSI for checking that it gets cleared in case of HSE PLL source.
        Utils::SetBit(RCC->PLLCFGR, RCC_PLLCFGR_PLLSRC_Pos, false);

        WHEN ("PLL is enabled with source from HSE and target of 109MHz and the frequency is read back")
        {
            Hal::Error error = Hal::Clocks::ConfigurePll(Hal::OscillatorType::highSpeed_external, Hal::MHz(109UL));
            Utils::SetBit(RCC->CR, RCC_CR_PLLRDY_Pos, true); // Set PLLRDY bit in order to be able to read the frequency.
            uint32_t frequency = Hal::Clocks::GetFrequency(Hal::OscillatorType::pll);
            uint32_t secondaryFrequency = Hal::Clocks::GetFrequency(Hal::OscillatorType::pllSecondary);

            THEN ("no errors shall occur")
            {
                REQUIRE (error == Hal::Error::noErrors);

                AND_THEN ("PLLP, PLLN, PLLM, and PLLQ shall have correct values")
                {
                    // 100MHz from 24MHz shall result in PLLP = 2, PLLN = 100, PLLM = 11.
                    PRINT_PLL();
                    INFO ("Frequency: " << frequency);
                    INFO ("Frequency: " << secondaryFrequency);

                    REQUIRE (Utils::CompareBits(RCC->PLLCFGR, RCC_PLLCFGR_PLLP_Msk, 0UL));
                    REQUIRE (Utils::CompareBits(RCC->PLLCFGR, RCC_PLLCFGR_PLLN_Msk, (100UL << RCC_PLLCFGR_PLLN_Pos)));
                    REQUIRE (Utils::CompareBits(RCC->PLLCFGR, RCC_PLLCFGR_PLLM_Msk, (11UL << RCC_PLLCFGR_PLLM_Pos)));
                    REQUIRE (Utils::CompareBits(RCC->PLLCFGR, RCC_PLLCFGR_PLLQ_Msk, (5UL << RCC_PLLCFGR_PLLQ_Pos)));

