JuhoL/ASch/Hal_STM32F429ZI/tests/UTest_Hal_Clocks.cpp
                    AND_THEN ("the PLL frequency shall be set to 109 090 909 Hz and secondary frequency to 43 636 363 Hz")
                    {
                        REQUIRE (frequency == 109090909UL);
                        REQUIRE (secondaryFrequency == 43636363UL);

                        AND_THEN ("the PLL source is set to HSE")
                        {
                            REQUIRE (Utils::GetBit(RCC->PLLCFGR, RCC_PLLCFGR_PLLSRC_Pos) == true);
                        }
                    }
                }
            }
        }
    }

    GIVEN ("system is at init state")
    {
        WHEN ("PLL is enabled with source from LSI and target of 120MHz")
        {
            Hal::Error error = Hal::Clocks::ConfigurePll(Hal::OscillatorType::lowSpeed_internal, Hal::MHz(120UL));

            THEN ("invalid parameter error shall occur")
            {
                REQUIRE (error == Hal::Error::invalidParameter);

                AND_THEN ("an assert failure shall trigger")
                {
                    REQUIRE (ASchMock::Assert::GetFails() == 1UL);
                }
            }
        }
    }

    GIVEN ("system is at init state")
    {
        WHEN ("PLL is enabled with source from HSI and target of 169MHz")
        {
            Hal::Error error = Hal::Clocks::ConfigurePll(Hal::OscillatorType::highSpeed_internal, Hal::MHz(169UL));

            THEN ("invalid parameter error shall occur")
            {
                REQUIRE (error == Hal::Error::invalidParameter);

                AND_THEN ("an assert failure shall trigger")
                {
                    REQUIRE (ASchMock::Assert::GetFails() == 1UL);
                }
            }
        }
    }

    GIVEN ("HSE is not running")
    {
        WHEN ("PLL is enabled with source from HSE and target of 120MHz")
        {
            Hal::Error error = Hal::Clocks::ConfigurePll(Hal::OscillatorType::highSpeed_external, Hal::MHz(120UL));

            THEN ("unavailable resource error shall occur")
            {
                REQUIRE (error == Hal::Error::unavailableResource);

                AND_THEN ("an assert failure shall trigger")
                {
                    REQUIRE (ASchMock::Assert::GetFails() == 1UL);
                }
            }
        }
    }

    GIVEN ("HSE is running, but frequency is not configured")
    {
        Utils::SetBit(RCC->CR, RCC_CR_HSERDY_Pos, true);
        Hal::Clocks::SetFrequency(Hal::OscillatorType::highSpeed_external, 0UL);

        WHEN ("PLL is enabled with source from non-running HSE and target of 120MHz")
        {
            Hal::Error error = Hal::Clocks::ConfigurePll(Hal::OscillatorType::highSpeed_external, Hal::MHz(120UL));

            THEN ("invalid parameter error shall occur")
            {
                REQUIRE (error == Hal::Error::invalidParameter);

                AND_THEN ("an assert failure shall trigger")
                {
                    REQUIRE (ASchMock::Assert::GetFails() == 1UL);
                }
            }
        }
    }
}

SCENARIO ("PLL registers are manually configured", "[hal_system]")
{
    Hal_Mock::InitRccRegisters();

    GIVEN ("system is at init state")
    {
        // Set PLL source to HSE for checking that it gets cleared in case of HSI PLL source.
        Utils::SetBit(RCC->PLLCFGR, RCC_PLLCFGR_PLLSRC_Pos, true);

        WHEN ("PLL is configured with valid register values from HSI")
        {
            Hal::pllRegisters_t registers =
            {
                .pllp = 8UL,
                .plln = 432UL,
                .pllm = 63UL,
                .pllq = 15UL
            };
            Hal::Error error = Hal::Clocks::ConfigurePllManually(Hal::OscillatorType::highSpeed_internal, registers);
            Utils::SetBit(RCC->CR, RCC_CR_PLLRDY_Pos, true); // Set PLLRDY bit in order to be able to read the frequency.
            uint32_t frequency = Hal::Clocks::GetFrequency(Hal::OscillatorType::pll);
            uint32_t secondaryFrequency = Hal::Clocks::GetFrequency(Hal::OscillatorType::pllSecondary);

            THEN ("no errors shall occur")
            {
                REQUIRE (error == Hal::Error::noErrors);

                AND_THEN ("PLLP, PLLN, PLLM, and PLLQ shall have correct values")
                {
                    // 100MHz from 24MHz shall result in PLLP = 2, PLLN = 100, PLLM = 11.
                    PRINT_PLL();
                    INFO ("Frequency: " << frequency);
                    INFO ("Frequency: " << secondaryFrequency);

                    REQUIRE (Utils::CompareBits(RCC->PLLCFGR, RCC_PLLCFGR_PLLP_Msk, (3UL << RCC_PLLCFGR_PLLP_Pos)));
                    REQUIRE (Utils::CompareBits(RCC->PLLCFGR, RCC_PLLCFGR_PLLN_Msk, (432UL << RCC_PLLCFGR_PLLN_Pos)));
                    REQUIRE (Utils::CompareBits(RCC->PLLCFGR, RCC_PLLCFGR_PLLM_Msk, (63UL << RCC_PLLCFGR_PLLM_Pos)));
                    REQUIRE (Utils::CompareBits(RCC->PLLCFGR, RCC_PLLCFGR_PLLQ_Msk, (15UL << RCC_PLLCFGR_PLLQ_Pos)));

                    AND_THEN ("the PLL frequency shall be set to 109 090 909 Hz and secondary frequency to 43 636 363 Hz")
                    {
                        REQUIRE (frequency == 13714286UL);
                        REQUIRE (secondaryFrequency == 7314286UL);

                        AND_THEN ("the PLL source is set to HSI")
                        {
                            REQUIRE (Utils::GetBit(RCC->PLLCFGR, RCC_PLLCFGR_PLLSRC_Pos) == false);
                        }
                    }
                }
            }
        }
    }

    GIVEN ("HSE is enabled and set as 24MHz")
    {
        // Enable HSE
        Utils::SetBit(RCC->CR, RCC_CR_HSERDY_Pos, true);
        // Set frequency
        Hal::Clocks::SetFrequency(Hal::OscillatorType::highSpeed_external, Hal::MHz(24UL));
        // Set PLL source to HSI for checking that it gets cleared in case of HSE PLL source.
        Utils::SetBit(RCC->PLLCFGR, RCC_PLLCFGR_PLLSRC_Pos, false);

        WHEN ("PLL is configured with valid register values from HSE")
        {
            Hal::pllRegisters_t registers =
            {
                .pllp = 2UL,
                .plln = 50UL,
                .pllm = 4UL,
                .pllq = 7UL
            };
            Hal::Error error = Hal::Clocks::ConfigurePllManually(Hal::OscillatorType::highSpeed_external, registers);
            Utils::SetBit(RCC->CR, RCC_CR_PLLRDY_Pos, true); // Set PLLRDY bit in order to be able to read the frequency.
            uint32_t frequency = Hal::Clocks::GetFrequency(Hal::OscillatorType::pll);
            uint32_t secondaryFrequency = Hal::Clocks::GetFrequency(Hal::OscillatorType::pllSecondary);

            THEN ("no errors shall occur")
            {
                REQUIRE (error == Hal::Error::noErrors);

                AND_THEN ("PLLP, PLLN, PLLM, and PLLQ shall have correct values")
                {
                    // 100MHz from 24MHz shall result in PLLP = 2, PLLN = 100, PLLM = 11.
                    PRINT_PLL();
                    INFO ("Frequency: " << frequency);
                    INFO ("Frequency: " << secondaryFrequency);

                    REQUIRE (Utils::CompareBits(RCC->PLLCFGR, RCC_PLLCFGR_PLLP_Msk, 0UL));
                    REQUIRE (Utils::CompareBits(RCC->PLLCFGR, RCC_PLLCFGR_PLLN_Msk, (50UL << RCC_PLLCFGR_PLLN_Pos)));
                    REQUIRE (Utils::CompareBits(RCC->PLLCFGR, RCC_PLLCFGR_PLLM_Msk, (4UL << RCC_PLLCFGR_PLLM_Pos)));
                    REQUIRE (Utils::CompareBits(RCC->PLLCFGR, RCC_PLLCFGR_PLLQ_Msk, (7UL << RCC_PLLCFGR_PLLQ_Pos)));

