JuhoL/ASch/Hal_STM32F429ZI/tests/UTest_Hal_Clocks.cpp
                    AND_THEN ("the PLL frequency shall be set to 109 090 909 Hz and secondary frequency to 43 636 363 Hz")
                    {
                        REQUIRE (frequency == Hal::MHz(150UL));
                        REQUIRE (APPROX_EQUAL(secondaryFrequency, 42857143UL, 3UL)); // Add some tolerance due to float inaccuracies.

                        AND_THEN ("the PLL source is set to HSE")
                        {
                            REQUIRE (Utils::GetBit(RCC->PLLCFGR, RCC_PLLCFGR_PLLSRC_Pos) == true);
                        }
                    }
                }
            }
        }
    }
}

SCENARIO ("Clock status is read", "[hal_system]")
{
    Hal_Mock::InitRccRegisters();

    GIVEN ("HSI is enabled")
    {
        // HSI is on by default

        WHEN ("the HSI status is checked")
        {
            bool isRunning = Hal::Clocks::IsRunning(Hal::OscillatorType::highSpeed_internal);

            THEN ("the check shall return true")
            {
                REQUIRE (isRunning == true);
            }
        }
    }

    GIVEN ("HSI is disabled")
    {
        // Disable HSI
        Utils::SetBit(RCC->CR, RCC_CR_HSIRDY_Pos, false);

        WHEN ("the HSI status is checked")
        {
            bool isRunning = Hal::Clocks::IsRunning(Hal::OscillatorType::highSpeed_internal);

            THEN ("the check shall return false")
            {
                REQUIRE (isRunning == false);
            }
        }
    }

    GIVEN ("HSE is enabled")
    {
        // Enable HSE
        Utils::SetBit(RCC->CR, RCC_CR_HSERDY_Pos, true);

        WHEN ("the HSE status is checked")
        {
            bool isRunning = Hal::Clocks::IsRunning(Hal::OscillatorType::highSpeed_external);

            THEN ("the check shall return true")
            {
                REQUIRE (isRunning == true);
            }
        }
    }

    GIVEN ("HSE is disabled")
    {
        // HSE is disabled by default

        WHEN ("the HSE status is checked")
        {
            bool isRunning = Hal::Clocks::IsRunning(Hal::OscillatorType::highSpeed_external);

            THEN ("the check shall return false")
            {
                REQUIRE (isRunning == false);
            }
        }
    }

    GIVEN ("LSI is enabled")
    {
        // Enable LSI
        Utils::SetBit(RCC->CSR, RCC_CSR_LSIRDY_Pos, true);

        WHEN ("the LSI status is checked")
        {
            bool isRunning = Hal::Clocks::IsRunning(Hal::OscillatorType::lowSpeed_internal);

            THEN ("the check shall return true")
            {
                REQUIRE (isRunning == true);
            }
        }
    }

    GIVEN ("LSI is disabled")
    {
        // LSI is disabled by default

        WHEN ("the LSI status is checked")
        {
            bool isRunning = Hal::Clocks::IsRunning(Hal::OscillatorType::lowSpeed_internal);

            THEN ("the check shall return false")
            {
                REQUIRE (isRunning == false);
            }
        }
    }

    GIVEN ("LSE is enabled")
    {
        // Enable LSE
        Utils::SetBit(RCC->BDCR, RCC_BDCR_LSERDY_Pos, true);

        WHEN ("the LSE status is checked")
        {
            bool isRunning = Hal::Clocks::IsRunning(Hal::OscillatorType::lowSpeed_external);

            THEN ("the check shall return true")
            {
                REQUIRE (isRunning == true);
            }
        }
    }

    GIVEN ("LSE is disabled")
    {
        // LSE is disabled by default

        WHEN ("the LSE status is checked")
        {
            bool isRunning = Hal::Clocks::IsRunning(Hal::OscillatorType::lowSpeed_external);

            THEN ("the check shall return false")
            {
                REQUIRE (isRunning == false);
            }
        }
    }

    GIVEN ("PLL is enabled")
    {
        // Enable PLL
        Utils::SetBit(RCC->CR, RCC_CR_PLLRDY_Pos, true);

        WHEN ("the PLL status is checked")
        {
            bool isRunning = Hal::Clocks::IsRunning(Hal::OscillatorType::pll);

            THEN ("the check shall return true")
            {
                REQUIRE (isRunning == true);
            }
        }
    }

    GIVEN ("PLL is disabled")
    {
        // PLL is disabled by default

        WHEN ("the PLL status is checked")
        {
            bool isRunning = Hal::Clocks::IsRunning(Hal::OscillatorType::pll);

            THEN ("the check shall return false")
            {
                REQUIRE (isRunning == false);
            }
        }
    }
}

SCENARIO ("Clock frequencies are written and read", "[hal_system]")
{
    Hal_Mock::InitRccRegisters();
    ASchMock::Assert::Init();

    GIVEN ("HSI is enabled")
    {
        // HSI is on by default

        WHEN ("HSI frequency is read")
        {
            uint32_t frequency = Hal::Clocks::GetFrequency(Hal::OscillatorType::highSpeed_internal);

            THEN ("frequency shall be 16MHz")
            {
                REQUIRE (frequency == Hal::MHz(16UL));
            }
        }
    }

    GIVEN ("HSI is enabled")
    {
        // HSI is on by default

        WHEN ("the HSI frequency is set to 10MHz")
        {
            Hal::Clocks::SetFrequency(Hal::OscillatorType::highSpeed_internal, Hal::MHz(10UL));
            uint32_t frequency = Hal::Clocks::GetFrequency(Hal::OscillatorType::highSpeed_internal);

            THEN ("an assert failure shall trigger")
            {
                REQUIRE (ASchMock::Assert::GetFails() == 1UL);

                AND_THEN ("the frequency shall still be 16MHz")
                {
                    REQUIRE (frequency == Hal::MHz(16UL));
                }
            }
        }
    }

    GIVEN ("HSE is enabled and its frequency is set to 24MHz")
    {
        // Enable HSE
        Utils::SetBit(RCC->CR, RCC_CR_HSERDY_Pos, true);
        Hal::Clocks::SetFrequency(Hal::OscillatorType::highSpeed_external, Hal::MHz(24UL));

        WHEN ("the HSE frequency is read")
        {
            uint32_t frequency = Hal::Clocks::GetFrequency(Hal::OscillatorType::highSpeed_external);

            THEN ("frequency shall be 24MHz")
            {
                REQUIRE (frequency == Hal::MHz(24UL));
            }
        }
    }

    GIVEN ("HSE is disabled and its frequency is set to 24MHz")
    {
        // HSE is disabled by default.
        Hal::Clocks::SetFrequency(Hal::OscillatorType::highSpeed_external, Hal::MHz(24UL));

        WHEN ("the HSE frequency is read")
        {
            uint32_t frequency = Hal::Clocks::GetFrequency(Hal::OscillatorType::highSpeed_external);

            THEN ("frequency shall be 0MHz")
            {
                REQUIRE (frequency == 0UL);
            }
        }
    }

    GIVEN ("LSI is enabled")
    {
        Utils::SetBit(RCC->CSR, RCC_CSR_LSIRDY_Pos, true);

