JuhoL/ASch/Hal_STM32F429ZI/tests/UTest_Hal_Clocks.cpp
        WHEN ("the LSI frequency is set to 30kHz")
        {
            Hal::Clocks::SetFrequency(Hal::OscillatorType::lowSpeed_internal, Hal::kHz(30UL));
            uint32_t frequency = Hal::Clocks::GetFrequency(Hal::OscillatorType::lowSpeed_internal);

            THEN ("an assert failure shall trigger")
            {
                REQUIRE (ASchMock::Assert::GetFails() == 1UL);

                AND_THEN ("the frequency shall still be 32kHz")
                {
                    REQUIRE (frequency == Hal::kHz(32UL));
                }
            }
        }
    }

    GIVEN ("LSE is enabled")
    {
        Utils::SetBit(RCC->BDCR, RCC_BDCR_LSERDY_Pos, true);

        WHEN ("the LSE frequency is set to 30kHz")
        {
            Hal::Clocks::SetFrequency(Hal::OscillatorType::lowSpeed_external, Hal::kHz(30UL));
            uint32_t frequency = Hal::Clocks::GetFrequency(Hal::OscillatorType::lowSpeed_external);

            THEN ("an assert failure shall trigger")
            {
                REQUIRE (ASchMock::Assert::GetFails() == 1UL);

                AND_THEN ("the frequency shall still be 32768Hz")
                {
                    REQUIRE (frequency == 32768UL);
                }
            }
        }
    }

    GIVEN ("PLL is enabled")
    {
        Utils::SetBit(RCC->CR, RCC_CR_PLLRDY_Pos, true);

        WHEN ("the PLL frequency is set to 100MHz")
        {
            Hal::Clocks::SetFrequency(Hal::OscillatorType::pll, Hal::MHz(100UL));

            THEN ("an assert failure shall trigger")
            {
                REQUIRE (ASchMock::Assert::GetFails() == 1UL);
            }
        }
    }

    GIVEN ("PLL is enabled")
    {
        Utils::SetBit(RCC->CR, RCC_CR_PLLRDY_Pos, true);

        WHEN ("the PLL secondary frequency is set to 48MHz")
        {
            Hal::Clocks::SetFrequency(Hal::OscillatorType::pllSecondary, Hal::MHz(48UL));

            THEN ("an assert failure shall trigger")
            {
                REQUIRE (ASchMock::Assert::GetFails() == 1UL);
            }
        }
    }

    GIVEN ("system is at init state")
    {
        WHEN ("the unknown frequency is read")
        {
            uint32_t frequency = Hal::Clocks::GetFrequency(Hal::OscillatorType::unknown);

            THEN ("frequency shall be 0MHz")
            {
                REQUIRE (frequency == 0UL);
            }
        }
    }
}

SCENARIO ("System clock frequency is read", "[hal_system]")
{
    Hal_Mock::InitRccRegisters();

    GIVEN ("HSI is system clock")
    {
        // HSI is system clock by default

        WHEN ("system clock frequency is read")
        {
            uint32_t frequency = Hal::Clocks::GetSysClockFrequency();

            THEN ("the frequency shall be 16MHz")
            {
                REQUIRE (frequency == Hal::MHz(16UL));
            }
        }
    }

    GIVEN ("24MHz HSE is system clock")
    {
        // HSE as system clock
        Utils::SetBits(RCC->CFGR, RCC_CFGR_SWS_Msk, RCC_CFGR_SWS_0);        
        Hal::Clocks::SetFrequency(Hal::OscillatorType::highSpeed_external, Hal::MHz(24UL));

        WHEN ("system clock frequency is read")
        {
            uint32_t frequency = Hal::Clocks::GetSysClockFrequency();

            THEN ("the frequency shall be 24MHz")
            {
                REQUIRE (frequency == Hal::MHz(24UL));
            }
        }
    }
}

SCENARIO ("System clock is selected", "[hal_system]")
{
    Hal_Mock::InitRccRegisters();
    HalMock::InitInternal();

    GIVEN ("HSE is system clock and HSI is enabled")
    {
        // Set HSE as system clock
        Utils::SetBits(RCC->CFGR, RCC_CFGR_SWS_Msk, RCC_CFGR_SWS_0);
        // HSI is enabled by default. No need to enable it again.
        // Set invalid value to SW bits for checking that the bits are set afterwards.
        Utils::SetBits(RCC->CFGR, RCC_CFGR_SW_Msk, RCC_CFGR_SW_Msk);
        // This tells the HAL that the system clock was changed successfully.
        SET_RETURN(HalMock::mockHalInternal, WaitForBitPatternToSet, false);

        WHEN ("the HSI is set as system clock source")
        {
            Hal::Error error = Hal::Clocks::SetSysClockSource(Hal::OscillatorType::highSpeed_internal);

            THEN ("no errors shall occur")
            {
                REQUIRE (error == Hal::Error::noErrors);

                AND_THEN ("SWS bits in RCC CFGR register shall be set to 00 and corresponding SW bits shall be waited")
                {
                    REQUIRE (Utils::CompareBits(RCC->CFGR, RCC_CFGR_SW_Msk, 0UL));
                    REQUIRE_PARAM_CALLS (1, HalMock::mockHalInternal, WaitForBitPatternToSet, RCC->CFGR, (uint32_t)RCC_CFGR_SWS_Msk, (uint32_t)0UL);
                }
            }
        }
    }

    GIVEN ("HSE is enabled")
    {
        Utils::SetBit(RCC->CR, RCC_CR_HSERDY_Pos, true);

        // Set invalid value to SW bits for checking that the bits are set afterwards.
        Utils::SetBits(RCC->CFGR, RCC_CFGR_SW_Msk, RCC_CFGR_SW_Msk);
        // This tells the HAL that the system clock was changed successfully.
        SET_RETURN(HalMock::mockHalInternal, WaitForBitPatternToSet, false);

        WHEN ("the HSI is set as system clock source")
        {
            Hal::Error error = Hal::Clocks::SetSysClockSource(Hal::OscillatorType::highSpeed_external);

            THEN ("no errors shall occur")
            {
                REQUIRE (error == Hal::Error::noErrors);

                AND_THEN ("SWS bits in RCC CFGR register shall be set to 01 and corresponding SW bits shall be waited")
                {
                    REQUIRE (Utils::CompareBits(RCC->CFGR, RCC_CFGR_SW_Msk, RCC_CFGR_SW_0));
                    REQUIRE_PARAM_CALLS (1, HalMock::mockHalInternal, WaitForBitPatternToSet, RCC->CFGR, (uint32_t)RCC_CFGR_SWS_Msk, (uint32_t)RCC_CFGR_SWS_0);
                }
            }
        }
    }

    GIVEN ("PLL is enabled")
    {
        Utils::SetBit(RCC->CR, RCC_CR_PLLRDY_Pos, true);

        // Set invalid value to SW bits for checking that the bits are set afterwards.
        Utils::SetBits(RCC->CFGR, RCC_CFGR_SW_Msk, RCC_CFGR_SW_Msk);
        // This tells the HAL that the system clock was changed successfully.
        SET_RETURN(HalMock::mockHalInternal, WaitForBitPatternToSet, false);

        WHEN ("the PLL is set as system clock source")
        {
            Hal::Error error = Hal::Clocks::SetSysClockSource(Hal::OscillatorType::pll);

            THEN ("no errors shall occur")
            {
                REQUIRE (error == Hal::Error::noErrors);

                AND_THEN ("SWS bits in RCC CFGR register shall be set to 10 and corresponding SW bits shall be waited")
                {
                    REQUIRE (Utils::CompareBits(RCC->CFGR, RCC_CFGR_SW_Msk, RCC_CFGR_SW_1));
                    REQUIRE_PARAM_CALLS (1, HalMock::mockHalInternal, WaitForBitPatternToSet, RCC->CFGR, (uint32_t)RCC_CFGR_SWS_Msk, (uint32_t)RCC_CFGR_SWS_1);
                }
            }
        }
    }

    GIVEN ("system is at init state")
    {
        // Set invalid value to SW bits for checking that the bits are set afterwards.
        Utils::SetBits(RCC->CFGR, RCC_CFGR_SW_Msk, RCC_CFGR_SW_Msk);
        // This tells the HAL that the system clock was changed successfully.
        SET_RETURN(HalMock::mockHalInternal, WaitForBitPatternToSet, false);

