JuhoL/ASch/Hal_STM32F429ZI/tests/UTest_Hal_Clocks.cpp
        WHEN ("the HSI is set as system clock source")
        {
            Hal::Error error = Hal::Clocks::SetSysClockSource(Hal::OscillatorType::highSpeed_internal);

            THEN ("no errors shall occur")
            {
                REQUIRE (error == Hal::Error::noErrors);

                AND_THEN ("SWS bits in RCC CFGR register shall not be changed")
                {
                    REQUIRE (Utils::CompareBits(RCC->CFGR, RCC_CFGR_SW_Msk, RCC_CFGR_SW_Msk));
                    REQUIRE_CALLS (0, HalMock::mockHalInternal, WaitForBitPatternToSet);
                }
            }
        }
    }

    GIVEN ("system is at init state")
    {
        // Set invalid value to SW bits for checking that the bits are set afterwards.
        Utils::SetBits(RCC->CFGR, RCC_CFGR_SW_Msk, RCC_CFGR_SW_Msk);

        WHEN ("the LSE is set as system clock source")
        {
            Hal::Error error = Hal::Clocks::SetSysClockSource(Hal::OscillatorType::lowSpeed_external);

            THEN ("invalid parameter error shall occur")
            {
                REQUIRE (error == Hal::Error::invalidParameter);

                AND_THEN ("SWS bits in RCC CFGR register shall not be changed")
                {
                    REQUIRE (Utils::CompareBits(RCC->CFGR, RCC_CFGR_SW_Msk, RCC_CFGR_SW_Msk));
                    REQUIRE_CALLS (0, HalMock::mockHalInternal, WaitForBitPatternToSet);
                }
            }
        }
    }

    GIVEN ("PLL is disabled")
    {
        // PLL is disabled by default.
        // Set invalid value to SW bits for checking that the bits are set afterwards.
        Utils::SetBits(RCC->CFGR, RCC_CFGR_SW_Msk, RCC_CFGR_SW_Msk);
        // This tells the HAL that the system clock was changed successfully.
        SET_RETURN(HalMock::mockHalInternal, WaitForBitPatternToSet, false);

        WHEN ("the PLL is set as system clock source")
        {
            Hal::Error error = Hal::Clocks::SetSysClockSource(Hal::OscillatorType::pll);

            THEN ("unavailable resource error shall occur")
            {
                REQUIRE (error == Hal::Error::unavailableResource);

                AND_THEN ("SWS bits in RCC CFGR register shall note be changed")
                {
                    REQUIRE (Utils::CompareBits(RCC->CFGR, RCC_CFGR_SW_Msk, RCC_CFGR_SW_Msk));
                    REQUIRE_CALLS (0, HalMock::mockHalInternal, WaitForBitPatternToSet);
                }
            }
        }
    }

    GIVEN ("HSE is enabled")
    {
        Utils::SetBit(RCC->CR, RCC_CR_HSERDY_Pos, true);

        // Set invalid value to SW bits for checking that the bits are set afterwards.
        Utils::SetBits(RCC->CFGR, RCC_CFGR_SW_Msk, RCC_CFGR_SW_Msk);
        // This tells the HAL that the system clock could not be changed.
        SET_RETURN(HalMock::mockHalInternal, WaitForBitPatternToSet, true);

        WHEN ("the HSI is set as system clock source")
        {
            Hal::Error error = Hal::Clocks::SetSysClockSource(Hal::OscillatorType::highSpeed_external);

            THEN ("timeout error shall occur")
            {
                REQUIRE (error == Hal::Error::timeout);
            }
        }
    }
}

SCENARIO ("System clock source is read", "[hal_system]")
{
    Hal_Mock::InitRccRegisters();

    GIVEN ("HSI is system clock")
    {
        // HSI is system clock by default

        WHEN ("system clock source is read")
        {
            Hal::OscillatorType type = Hal::Clocks::GetSysClockSource();

            THEN ("the clock type shall be HSI")
            {
                REQUIRE (type == Hal::OscillatorType::highSpeed_internal);
            }
        }
    }

    GIVEN ("HSE is system clock")
    {
        // Set HSE as system clock
        Utils::SetBits(RCC->CFGR, RCC_CFGR_SWS_Msk, RCC_CFGR_SWS_0);

        WHEN ("system clock source is read")
        {
            Hal::OscillatorType type = Hal::Clocks::GetSysClockSource();

            THEN ("the clock type shall be HSE")
            {
                REQUIRE (type == Hal::OscillatorType::highSpeed_external);
            }
        }
    }

    GIVEN ("PLL is system clock")
    {
        // Set PLL as system clock
        Utils::SetBits(RCC->CFGR, RCC_CFGR_SWS_Msk, RCC_CFGR_SWS_1);

        WHEN ("system clock source is read")
        {
            Hal::OscillatorType type = Hal::Clocks::GetSysClockSource();

            THEN ("the clock type shall be PLL")
            {
                REQUIRE (type == Hal::OscillatorType::pll);
            }
        }
    }
}
